package string;

import org.apache.commons.lang3.StringUtils;

public class CountMatches {

	public static void main(String[] args) {
		String line = "행복을 드리는 케이티 백 주현 입니다 아 여보세요 네 안녕하세요 네네 저희가 인터넷 결합 이거 요금을 보고있거든요 네네 근데 이게 약정 기간에 네 지금 제가 용지를 보고 있는데 내년 사월이십팔일까지 들을 준대요 아 예예 그것 좀 확인 좀 해볼려고요 그 기간이라 위약금에 대해서 확인해드리면 되겠습니까 네 먼저 고객님 가입자분 생년월일하고 성함 좀 말씀해주시겠어요 아 생년월일이요 칠십 년 십 이월 구일이시고요 십 이월 구일이요 네 네 그리고 또 뭐라그랬 승자 명의 어떻게 되시나요 예 였습니다 이 영 영 네 유효일자 예 이 영자 였습니다 네 주자요 네 네 네 오월달에도 됐다 그러면 네대 할때 내에요 경례할때 냈어요 아 네 죄송합니다 잠깐만 기다려주시겠어요 네 네 한번 더 확인해볼게요 고객님 천 구백 칠십 년 십 이월 구일 맞나요 네 그리고 성함이 명길 네 이월 영 맞죠 네 이월이요 고객님 예예 여 이자 맞죠 리을에 여이 예 네 그러면 고객님 죄송합니다만 지금 제가 뭘 잘못 들었는지 조회가 안된다고 떠서요 혹시 지금 청구서 가지고 있어요 예예 그러면 거기 보면 명세서 번호라고 열한자리 숫자 있을 텐데 그걸로 좀 확인할 수 있을까요 아니에요 아 명세서 명세서 어 빠르면 씨로 돼있는가 아 제가 한번 일 일 공 육 네 일 공 육 칠 육 칠 팔 삼 공 칠 공 칠 일 팔 삼 육 삼 공 칠 공 어 자제분의 일 공 일 육 일 공 육 일 예 칠 육 칠 네 칠 육 칠 팔 삼 공 칠 공 팔 삼 공 칠 공 아 예 확인 되었고요 고객님 저희쪽에 가운데가 이후로 되있더라고요 영자 래자 이렇게 돼있었 이게 맞지 않아서 확인이 안되고 아 그래요 네 지금 확인 다 되었고요 고객님 잠시만 기다려 주시겠습니까 네 였습니다 네 우선은 확인하신단 일 이분 정도 소요될 예정이세요 조회하면서 잠시만 좀 여쭤볼게요 위약금을 알아보는 이유가 있으신거에요 고객님 어 보니까 날짜 그 사용 서비스 약정 기간이 네 십 삼년 제가 사월 이십 구일날 신청해서 신림면 네네 사월이십팔일인데 네 어 이게 저희가 티비만 이거 뭔지 예예 저희가 이천 십 이년도에 신청을 했었거든요 이천 십 이년도요 예 예예 그럼 여기에는 해지기 만 서비스 약정 기간이 묶었어요 네 맞아요 고객님 이게 다른거는 네 예 이쪽에 인터넷과 티비는 먼저 개통을 했고요 고객님 그리고 추가 티비 그거 하나를 나중에 하셔가지고 지금 유 추가 티비만 약정이 남아있는 거고요 아 네 기본 인터넷과 티비는 약합니다 끝난걸로 확인 되세요 고객님 그죠 네네 만약에 제가 이거를 네 변경하면 어떻게 되나요 나오나 해서요 우선은 추가 티비 부분 위약금이 있어서 이걸 확인하고있고요 나오는대로 말씀드릴게요 네 혹시 이거를 해지를 했을 때 위약금 알아보는 이유가 있으세요 아 예예 이사를 지금 갈 가야될거 같아서 물어보니까 네 이사가는 거 려면 고객님 옮기셔도 돼서 혹시 여쭤보는거고요 이게 지금 고객님 만약에라도 혹시 예 추가 티비가 내년 사월까지로 되어 있는데 어차피 이사가세 계속 써도 된다 라면은 다시 삼년 재약정을 할 수가 있어요 그랬을 때 인터넷 기본료가 만 육천 원에 티비요금 만 팔백 원 이렇게 요금 할인 받을 수 있어서 이제 여쭤봤던 거고요 지금 추가 티비 해지했을 때 위약금이 한 팔만 칠천 원 정도로 예상되고 있습니다 근데 왜 미납금이 그렇게 많이 나와요 근데 우선 불편하게 드려 너무 죄송합니다 근데 이게 고객님 추가 티비가 기본 요금제가 만 오천 육백 원에 부가세 별도요 조건이라면 쓰고 있을거에요 네 그런데 고객님께서 만약에 삼년이 아니라 약정기간은 이년만 통 했다라면 당일은 지금 될게 없는데요 이년약정 했을때 금액이 어떻게 들어가냐면 이만 원에서 정정하면 원래 칠천 원하고 장비 다 칠천 원에서 까지 영쩜 바로 고객님 이냐면 약정했으면 사용료는 오천 구백 오십 원이고 장비 임대료가 삼천 원이세요 근데 삼년을 했기 때문에 삼천 구백 오십 원씩을 할인을 더 해드린거거든요 근데 제가 이거 할 때요 해지할 때 그 상향을 한거를 제가 약정을 안그랬었거든요 네 고객님 그러면은요 네 제가 어 이전을 하면서 그거 일년을 썼었어요 거의 일년은 정확하게 안되는데 네 십 이년도 칠월달에 제가 들어가서 십 삼년도 사월에 이사를 했어요 옮겼어요 네 그러면서 여기서 우리가 왜 집으로 하더니 이년 계약 있잖아요 예예 그래서 저는 이거 없는줄 알았는데 여기 보니까 생년이 와서 제가 물어보는 거에요 아 네 이게 네 의경 한도 안되는 저 이게 어 물어보지도 않고 이렇게 돼있는지를 네 우선 고객님 너무 죄송합니다만 이년 했을때 하고 삼년했을때 여가 기본요금제에서도 틀리기 때문에 저희가 뭐 이년하면 얼마입니다 삼년하면 얼마입니다 이렇게 염수지 열리 말씀드리진 않지만 삼년했을때 이렇게 됩니다 라고 안내를 해드리거든요 일단 이거 접수는 고객님 다른 데서 신청이 된 건 아니고 저희 백 인터넷이라서 그때 전화 주셔가지고 상담해서 가입한걸로 되어 있더라고요 만약에라도 육에 피로 확인이 필요하다라면 접수된 곳에 저희가 전달해서 확인 한번 해보고 연락 드리도록 전달 할 수 있거든요 그러면 예 잠깐만요 그러면 패밀 놔두고 네 티비는 놔두고 내년 사월까지 쓰고 요 예예 지금 이거 다른걸로 들어가도 되나요 그럼 고객님 너무 죄송하게도 지우면 예 네 일단 고객님이 추가 티비가 있는 상태에서는요 인터넷을 해지를 할 수가 없으세요 근데 만약에 티비만 여기서 하나 약정끝난거 이건 하나 빼셔도 상관은 없는데 이거 빼게 되면 요금제가 다 밖이거든요 인터넷 요금 이만 오천 오백 원으로 올라가고 티비요금도 만 육천 원을 올라가기 때문에 아드님 끝나는 거고요 네 왜냐면 고객님 결합상품에 결합 때문에 요금이 지금 들어가있어요 인터넷과 티비 기본이오 근데 결합을 하나 풀고 하나를 해지를 했어요 그러면 다시 삼년으로 복지 않는 이상 결합이 들어오 생성이 안되기 때문에 내년 사월까지만 쓸거라면은 결합 안된걸로 쓰셔야 되는데 그 비용이나 세가지를 다 쓰는 비용이나 차이가 없다라는거죠 저 유학이면 고객님 이사가서 이전비 따로 받지 않습니다 아 이전 설치 받으셔서 만기때 까지 사용해보시고 남길 했을때 아까 제가 설명드린 것처럼 재약정이 돼서 한번 더 생각해보고 결정하세요 고객님 약정 하 아니 그 위약금이 팔만 원씩 나온다고요 네 팔만 구천 원이오 구만 원돈이 뭐 이렇게 되세요 지금 시월 사개월을 했죠 남았스텔개월인데 근데 지금 현재 저희가 티비 한대 거실이 네 현재 티비 것으로 지금 채널이 안나온 제가 한 일년이 되가요 예 제가 에이에스 신청을 안해버렸어요 네 자꾸 이게 불편하더라고 안돼더라고요 아 우선 사용하시는데 불편하게 드려 죄송합니다 고객님 그러면 이게 지금 네 이천 십 이년도에 설치 받은 거라서 삼년 돼 설치 받는거 두가지가 있잖아요 지 안나오네 아 십 삼년도 거요 네 음 우선은 고객님 만약에 사 이 사 일정이 혹시 언제세요 아니요 지금 그게 이제 생각을 해야되는거라 지금 이걸 한번 물어본거에요 아 네 그 설정이 된 게 아니고 결정을 안나서 여쭤보는 거에요 그럼 고객님 지금 있는 상태에서 저희가 그 장비 일단 한번 교체 해가지고 직원 방문해서 거실에서도 사용할 수 있도록 에이에스 빨리 요청해드릴게요 일단은 안나왔어요 일월달 이런걸 거실 티비를 안보고 있어요 저희가 우선은 불편하지 않아가지고 입니다 네 일단 뭐 지금 방문일정 한번 저희가 만 지금 확인하시는건 아닌데 예 저도 지금 보면은 뭐 당일 오후나 아니면 다음날 이렇게는 되더라고요 근데 지금 시간대가 오후 니까 아마 내일쯤 가능할거 같거든요 고객님 아 예예 알겠습니다 네네 네 연락주신 이 번호로 지금 에서도 뭐 제가 뭐 주나요 아니요 요금제도 전혀 없으세요 고객님 아 예 네 약정 달라 일단 알겠습니다 니까 보다 망가지 네네 네 네 알겠습니다 고객님 네 알겠습니다 네 네";
		String keyword = "고객님 아";
		
		int x = StringUtils.countMatches(line, keyword);
		int z = line.length() - line.replace(keyword, "").length();
		
		System.out.println(x);
		System.out.println(z);
		
		
		
	}

}
